app/Controllers/koki/User_kasir.php

SELECT *
FROM `pesanan`
WHERE `status_pesanan` IN ('selesai','bayar')
ORDER BY `id_pesanan`
---
    public function index()
    {
        $rincian = new M_detailpesanan();
        $pesanan = new M_pesanan();
        $data['pesanan'] = $pesanan->orderBy('id_pesanan')->whereIn('status_pesanan',['selesai','bayar'])->findAll();

SELECT *
FROM `transaksi`
WHERE `id_pesanan` = '95'
ORDER BY `id_pesanan`
---
    public function struk($id_pesanan){

        $transaksi = new M_transaksi();
        $rincian = new M_detailpesanan();
        $data['rincian'] = $rincian->getRincian();
        $data['transaksi'] = $transaksi->orderBy('id_pesanan')->where('id_pesanan', $id_pesanan)->findAll();