app/Controllers/koki/User_koki.php

SELECT *
FROM `pesanan`
ORDER BY `id_pesanan`
SELECT *
FROM `detail_pesanan`
ORDER BY `id_pesanan`
---
    public function index()
    {
        $koki = new M_pesanan;
        $detail = new M_detailpesanan();
        $data['koki'] = $koki->orderBy('id_pesanan')->findAll();
        $data['detail'] = $detail->orderBy('id_pesanan')->findAll();