app/Controllers/Home.php

SELECT *
FROM `menu`
ORDER BY `id_menu` DESC
---
    public function menu()
    {
        $products = new M_menu();
        $data['products'] = $products->orderby('id_menu', 'DESC')->findAll();