app/Controllers/Keranjang.php

SELECT *
FROM `menu`
WHERE `menu`.`id_menu` = '70'
---
    public function beli($id_menu)
    {
        $menuModel = new M_menu();
        $menu = $menuModel->find($id_menu);

INSERT INTO `pesanan` (`no_meja`, `nama_pelanggan`, `jml_pesanan`, `status_pesanan`, `tanggal`, `total_harga_seluruh`) VALUES ('6', 'okta', 1, 'menunggu', '2023-02-16 12:20:35', 140000)
---
    public function simpan()
    {
        date_default_timezone_set('Asia/Jakarta');
        $pesanan = new M_pesanan();
        $detail = new M_detailpesanan();

        $items = array_values(session('cart'));

        $simpan = $this->request->getPost();

        $request = [];

        $data = [
            "no_meja" => $this->request->getPost('no_meja'),
            "nama_pelanggan" => $this->request->getPost('nama_pelanggan'),
            "jml_pesanan" => count($items),
            "status_pesanan" => "menunggu",
            "tanggal" => date("Y-m-d H:i:s"),
            "total_harga_seluruh" => $this->total(),
        ];

        $pesanan->insert($data);