app/Controllers/Login.php

SELECT *
FROM `user`
ORDER BY `id`
---
    public function tambahuser()
    {
        $users = new M_login();
        $data['users'] = $users->orderby('id')->findAll();