app/Controllers/Menu.php

    public function index()
    {
        $products = new M_menu();
        $data['products'] = $products->orderby('id_menu', 'DESC')->where('jenis_menu', 'Main course')->findAll();
---
SELECT *
FROM `menu`
WHERE `jenis_menu` = '1'
ORDER BY `id_menu` DESC

    public function snacks()
    {
        $products = new M_menu();
        $data['products'] = $products->orderby('id_menu', 'DESC')->where('jenis_menu', 'snacks')->findAll();
---
SELECT *
FROM `menu`
WHERE `jenis_menu` = 'snacks'
ORDER BY `id_menu` DESC