app/Controllers/Menu.php

    public function uncaanmansure()
    {
        $products = new M_menu();
        $data['products'] = $products->where('jenis_menu', "Unca'an")->findAll();
---
SELECT *
FROM `menu`
WHERE `jenis_menu` = 'Unca\'an'

    public function sweetooth()
    {
        $products = new M_menu();
        $data['products'] = $products->where('jenis_menu', 'Sweet Tooth')->findAll();
---
SELECT *
FROM `menu`
WHERE `jenis_menu` = 'Sweet Tooth'