app/Models/M_detailpesanan.php

SELECT *
FROM `detail_pesanan`
JOIN `menu` ON `menu`.`id_menu`=`detail_pesanan`.`id_menu`
JOIN `pesanan` ON `pesanan`.`id_pesanan`=`detail_pesanan`.`id_pesanan`
---
    public function getRincian()
    {
         return $this->db->table('detail_pesanan')
         ->join('menu','menu.id_menu=detail_pesanan.id_menu')
         ->join('pesanan', 'pesanan.id_pesanan=detail_pesanan.id_pesanan')
         ->get()->getResultArray();