app/Models/M_login.php

    function isAlreadyRegister($authid){
        return $this->db->table('user')->getwhere(['oauth_id'=>$authid])->getRowArray()>0?true:false;
---
SELECT *
FROM `user`
WHERE `oauth_id` = '116113486905623875501'

    function updateUserData($userdata, $authid){
         $this->db->table('user')->where(['oauth_id'=>$authid])->update($userdata);
---
UPDATE `user` SET `nama_user` = ' ', `email` = 'nadiasalsabila2201@gmail.com', `updated_at` = '2022-11-30 06:18:59'
WHERE `oauth_id` = '116113486905623875501'

    public function login($username, $password){
        return $this->db->table('user')->where([
            'username' => $username,
            'password' => $password,
        ])->get()->getRowArray();
---
SELECT *
FROM `user`
WHERE `username` = 'm'
AND `password` = 'm'