app/Models/M_menu.php

SELECT COUNT(*) AS `numrows`
FROM `pesanan`
---
    public function total_pesanan_baru()
    {
        return $this->db->table('pesanan')->countAllResults();

SELECT COUNT(*) AS `numrows`
FROM `menu`
---
    public function total_daftar_menu()
    {
        return $this->db->table('menu')->countAllResults();