app/Models/M_transaksi.php

    public function rincian(){
        return $this->db->table('transaksi')
        ->join('pesanan', 'pesanan.id_pesanan=transaksi.id_pesanan')
        ->join('user', 'user.id=transaksi.id')
        ->get()->getResult();
---
SELECT *
FROM `transaksi`
JOIN `pesanan` ON `pesanan`.`id_pesanan`=`transaksi`.`id_pesanan`