app/Controllers/kasir/Menukasir.php

    public function index()
    {

        $products = new M_menu();
        $data['products'] = $products->orderby('id_menu', 'DESC')->findAll();
---
SELECT *
FROM `menu`
ORDER BY `id_menu` DESC

    public function edit($id_menu)
    {
        $products = new M_menu();
        $data['product'] = $products->find($id_menu);
---
SELECT *
FROM `menu`
WHERE `menu`.`id_menu` = '79'